Repository: welissonArley/MyRecipeBook
Catalog: src/Shared/MyRecipeBook.Exceptions/ResourceMessagesException.*.resx
Languages: fr, pt_br, pt_pt

# AT_LEAST_ONE_INGREDIENT
source: Note that at least one ingredient is required.
fr: Notez qu'au moins un ingrédient est requis.
pt_br: Observe que é necessário pelo menos um ingrediente.
pt_pt: Note-se que é necessário pelo menos um ingrediente.

# AT_LEAST_ONE_INSTRUCTION
source: Please ensure there is at least one instruction provided for the recipe.
fr: Veillez à ce qu'il y ait au moins une instruction pour la recette.
pt_br: Certifique-se de que haja pelo menos uma instrução fornecida para a receita.
pt_pt: Certifique-se de que é fornecida pelo menos uma instrução para a receita.

# CODE_INVALID
source: Invalid code.
fr: Code non valide.
pt_br: Código inválido.
pt_pt: Código inválido.

# CODE_RESET_PASSWORD_REQUIRED
source: A code to reset your password is required.
fr: Un code pour réinitialiser votre mot de passe est nécessaire.
pt_br: É necessário um código para repor a sua palavra-passe.
pt_pt: É necessário um código para repor a sua palavra-passe.

# COOKING_TIME_NOT_SUPPORTED
source: The provided cooking time value is not supported.
fr: La valeur de temps de cuisson fournie n'est pas prise en charge.
pt_br: O valor de tempo de preparo fornecido não é suportado.
pt_pt: O valor de tempo de preparo fornecido não é suportado.

# DIFFICULTY_LEVEL_NOT_SUPPORTED
source: The specified difficulty level for the recipe is not supported.
fr: Le niveau de difficulté spécifié pour la recette n'est pas pris en charge.
pt_br: O nível de dificuldade especificado para a receita não é compatível.
pt_pt: O nível de dificuldade especificado para a receita não é suportado.

# DISH_TYPE_NOT_SUPPORTED
source: The chosen dish type is not supported.
fr: Le type de plat choisi n'est pas supporté.
pt_br: O tipo de prato escolhido não é suportado.
pt_pt: O tipo de prato selecionado não é suportado.

# DUPLICATED_INGREDIENTS_IN_LIST
source: Duplicated ingredients are not allowed in the list.
fr: Les ingrédients en double ne sont pas autorisés dans la liste.
pt_br: Ingredientes duplicados não são permitidos na lista.
pt_pt: Não são permitidos ingredientes duplicados na lista.

# EMAIL_ALREADY_REGISTERED
source: Email already registered on the platform.
fr: Email déjà enregistré sur la plateforme
pt_br: E-mail já registrado na plataforma.
pt_pt: E-mail já registado na plataforma

# EMAIL_EMPTY
source: The email cannot be empty.
fr: L'email ne peut pas être vide.
pt_br: O e-mail não pode estar vazio.
pt_pt: O correio eletrónico não pode estar vazio.

# EMAIL_INVALID
source: The email is invalid.
fr: L'e-mail n'est pas valide.
pt_br: O e-mail é inválido.
pt_pt: O correio eletrónico é inválido.

# EMAIL_OR_PASSWORD_INVALID
source: Invalid e-mail and/or password.
fr: E-mail et/ou mot de passe invalide.
pt_br: E-mail e/ou senha inválidos.
pt_pt: E-mail e/ou palavra-passe inválidos.

# EXPIRED_CODE
source: The code is expired.
fr: Le code est expiré.
pt_br: O código expirou.
pt_pt: O código expirou.

# EXPIRED_SESSION
source: Your session has expired. Please log in again to continue.
fr: Votre session a expiré. Veuillez vous connecter à nouveau pour continuer.
pt_br: Sua sessão expirou. Faça login novamente para continuar.
pt_pt: A sua sessão expirou. Inicie sessão novamente para continuar.

# GENERATE_ONE_RECIPE_PER_DAY
source: Sorry, you can only generate one recipe per day. Come back tomorrow!
fr: Désolé, vous ne pouvez générer qu'une seule recette par jour. Revenez demain !
pt_br: Desculpe, mas você só pode gerar uma receita por dia. Volte amanhã!
pt_pt: Lamento, mas só pode gerar uma receita por dia. Volte amanhã!

# INGREDIENT_EMPTY
source: The ingredient is left empty, please provide a valid value.
fr: L'ingrédient est vide, veuillez fournir une valeur valide.
pt_br: O ingrediente foi deixado em branco; forneça um valor válido.
pt_pt: O ingrediente está vazio, por favor indique um valor válido.

# INGREDIENT_NOT_FOLLOWING_PATTERN
source: Invalid ingredient format. Please ensure the ingredient follows our pattern.
fr: Format d'ingrédient non valide. Veuillez vous assurer que l'ingrédient respecte notre modèle.
pt_br: Formato de ingrediente inválido. Verifique se o ingrediente segue nosso padrão.
pt_pt: Formato de ingrediente inválido. Certifique-se de que o ingrediente segue o nosso padrão.

# INSTRUCTION_EMPTY
source: The instruction is left empty, please provide a valid instruction.
fr: L'instruction est vide, veuillez fournir une instruction valide.
pt_br: A instrução foi deixada em branco; forneça uma instrução válida.
pt_pt: A instrução foi deixada em branco, por favor, forneça uma instrução válida.

# INSTRUCTION_EXCEEDS_LIMIT_CHARACTERS
source: The instruction exceeds the maximum limit of 2000 characters.
fr: L'instruction dépasse la limite maximale de 2000 caractères.
pt_br: A instrução excede o limite máximo de 2000 caracteres.
pt_pt: A instrução excede o limite máximo de 2000 caracteres.

# INVALID_NUMBER_INGREDIENTS
source: Invalid number of ingredients. The list must contain between 1 and 5 ingredients.
fr: Nombre d'ingrédients non valide. La liste doit contenir entre 1 et 5 ingrédients.
pt_br: Número inválido de ingredientes. A lista deve conter entre 1 e 5 ingredientes.
pt_pt: Número inválido de ingredientes. A lista deve conter entre 1 e 5 ingredientes.

# INVALID_PASSWORD
source: The password must be longer than 6 characters.
fr: Le mot de passe doit comporter plus de 6 caractères
pt_br: A senha deve ter mais de 6 caracteres.
pt_pt: A palavra-passe deve ter mais de 6 caracteres.

# INVALID_SESSION
source: We couldn't find a valid session. Please log in to access this feature.
fr: Nous n'avons pas trouvé de session valide. Veuillez vous connecter pour accéder à cette fonctionnalité.
pt_br: Não foi possível encontrar uma sessão válida. Faça login para acessar esse recurso.
pt_pt: Não foi possível encontrar uma sessão válida. Inicie sessão para aceder a esta funcionalidade.

# NAME_EMPTY
source: The name cannot be empty.
fr: Le nom ne peut pas être vide.
pt_br: O nome não pode estar vazio.
pt_pt: O nome não pode estar vazio.

# NON_NEGATIVE_INSTRUCTION_STEP
source: Use a non-negative value for the instruction step.
fr: Utilisez une valeur non négative pour l'étape de l'instruction.
pt_br: Use um valor não negativo para a etapa de instrução.
pt_pt: Utilizar um valor não negativo para o passo de instrução.

# NO_TOKEN
source: Request don't have token.
fr: La demande n'a pas de jeton.
pt_br: A solicitação não tem token.
pt_pt: O pedido não tem token.

# ONLY_IMAGES_ACCEPTED
source: Only images (PNG, JPG, JPEG) are accepted.
fr: Seules les images (PNG, JPG, JPEG) sont acceptées.
pt_br: Somente imagens (PNG, JPG, JPEG) são aceitas.
pt_pt: Só são aceites imagens (PNG, JPG, JPEG).

# PASSWORD_DIFFERENT_CURRENT_PASSWORD
source: The password entered is different from the current password.
fr: Le mot de passe saisi est différent du mot de passe actuel.
pt_br: A senha inserida é diferente da senha atual.
pt_pt: A palavra-passe introduzida é diferente da palavra-passe atual.

# PASSWORD_EMPTY
source: The password cannot be empty.
fr: Le mot de passe ne peut pas être vide.
pt_br: A senha não pode estar vazia.
pt_pt: A palavra-passe não pode estar vazia.

# RECIPE_NOT_FOUND
source: The recipe could not be found.
fr: La recette n'a pas été trouvée.
pt_br: Não foi possível encontrar a receita.
pt_pt: Não foi possível encontrar a receita.

# RECIPE_TITLE_EMPTY
source: The recipe title has been left blank. Please provide a valid title.
fr: Le titre de la recette est laissé vide, veuillez fournir un titre valide.
pt_br: O título da receita foi deixado em branco. Forneça um título válido.
pt_pt: O título da receita foi deixado em branco. Forneça um título válido.

# TWO_OR_MORE_INSTRUCTIONS_SAME_ORDER
source: When adding instructions, please ensure that each one has a unique step number. Two or more instructions cannot have the same step.
fr: Lorsque vous ajoutez des instructions, veillez à ce que chacune d'entre elles ait un numéro d'étape unique. Deux instructions ou plus ne peuvent pas avoir la même étape.
pt_br: Ao adicionar instruções, certifique-se de que cada uma tenha um número de etapa exclusivo. Duas ou mais instruções não podem ter o mesmo pedido.
pt_pt: Ao adicionar instruções, certifique-se de que cada uma tem um número de passo único. Duas ou mais instruções não podem ter o mesmo passo.

source: Unknown error.
fr: Erreur inconnue.
pt_br: Erro desconhecido.
pt_pt: Erro desconhecido.

# USER_WITHOUT_PERMISSION_ACCESS_RESOURCE
source: You can't access this resource.
fr: Vous ne pouvez pas accéder à cette ressource.
pt_br: Você não tem permissão para acessar esse recurso.
pt_pt: Você não tem permissão para aceder a este recurso.
